W6D3/routes/app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 3]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
SELECT "comments".* FROM "comments"
---
    def index
        if params[:user_id]
            render json: User.find_by(id: params[:user_id]).comments
        elsif params[:artwork_id]
            render json: Artwork.find_by(id: params[:artwork_id]).comments
        else
            render json: Comment.all

INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["artwork_id", 3], ["body", "YOOOO ITS ME ERINNN!"], ["created_at", "2021-04-22 22:05:17.328083"], ["updated_at", "2021-04-22 22:05:17.328083"]]
---
    def create
        comment = Comment.new(comment_params)
        if comment.save!

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 5]]
---
    def destroy
        comment = Comment.find_by(id: params[:id])
        if comment.destroy!