W6D3/routes/app/controllers/likes_controller.rb

    def index
        if params[:comment_id]
            comment = Comment.find_by(id: params[:comment_id])
            render json: comment.likes
        else
            render json: Like.all
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "likes".* FROM "likes"