W6D3/routes/app/controllers/users_controller.rb

    def index
        query = request.query_parameters[:username]
        if query
            render json: User.where(username: query)
        else
            @users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "Erin"]]
SELECT "users".* FROM "users"

    def edit
        p params
        @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def destroy
        user = User.find_by(id: params[:id])
        if user
            user_copy = User.new(id: user.id, username: user.username)
            if user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]

    def update
        @user = User.find_by(id: params[:id])
        if @user
            if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "erinA"], ["updated_at", "2021-04-22 23:55:45.449746"], ["id", 3]]