Week-8/W8D1/Reddit_Clone/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "SseWLLVBvJKynuBqyE2N2Q"], ["updated_at", "2021-05-03 20:42:01.556283"], ["id", 1]]
---
    def create
        @user = User.create(user_params)

        if @user.save